{"data":{"site":{"siteMetadata":{"title":"Unveiled Leadership Coaching"}},"markdownRemark":{"id":"7ba0fe0c-3410-573c-b531-43d3b26c5935","excerpt":"","html":"","frontmatter":{"title":"Our Leadership","page_layout":[{"template":"content-container","slides":null,"carousel_slides":null,"container_type":"1 Column","container_tab_color":"Custom","tab_color":null,"title_text":"Our Leadership","title_icon":null,"title_alignment":null,"title_size":null,"color":"White","body_copy":null,"body_copy_alignment":null,"show_color_tab":false,"background_color":"Rainbow","has_cards":true,"has_list":false,"list_elements":[],"html":null,"cards":[{"title":"Michelle Jones Johnson","icon":null,"tab_color":"#7B1FA2","card_type":"Profile Card","card_background_color":"#FFFFFF","detail_list":[],"profile_image":"../../uploads/leader0.jpg","profile_subtitle":"Founder & President","body_copy":"Michelle’s work with clients is influenced by her 20+ year career as an HR and Talent Strategist, Certified Leadership Coach, and Organizational Consultant in corporate and healthcare organizations, professional service firms, and institutions of higher education. She has led human resource teams in both public and private organizations within a variety of industries, including healthcare, higher education, legal, engineering, architecture, and sales.\n\nAs a consultant, she has provided services to a diverse array of corporate, non-profit, and educational institutions. Michelle earned a Master’s in Business administration from the Whitman School of Management at Syracuse University, a Master’s in Organizational Management from the University of Phoenix, and a Bachelor’s in Sociology from the University of Michigan. In addition, she holds certifications as a Senior Professional in Human Resources (SPHR), Strategic Workforce Planning (SWP), Professional in Labor Relations (CPLR), and is a Certified ship in North Carolina.."},{"title":"Dr. Gary Gemmill","icon":null,"tab_color":"#477EFF","card_type":"Profile Card","card_background_color":"#FFFFFF","detail_list":[],"profile_image":"../../uploads/leader1.jpg","profile_subtitle":"Consultant","body_copy":"Gary Gemmill, Ph.D, is a Professor Emeritus of Organizational Behavior at the Whiteman School of Management, Syracuse University. He has been certified as a Professional Group Development Consultant by the International Association of Applied Social Scientists and recognized as a Professional Personal Growth Consultant and Group Development Consultant by the Association for Creative Change in Religion and Other Social Systems.\n\nHe leads intensive experiential programs in personal growth, leadership dynamics, and team development around the world. He has also written several professional articles on the psychodynamics of personal growth and group development.\n\nHe is co-author of the groundbreaking book, “A View from the Cosmic Mirror: The Reflection of Self in Everyday Life”, with George Kraus, Ph.D. (www.thecosmicmirror.org). He has also served on the editorial board of the journal Small Group Research and serves as a manuscript reviewer for Human Relations. He has also taught intensive graduate courses in Gestalt Therapy at Southern Connecticut State College and at the University of Rhode Island.\n\nAdditionally, he has been on the staff for Human Relations Programs offered through the Continuing Education Center at the Theological Seminary at Princeton. He has a postgraduate diploma in Gestalt Therapy from the Gestalt Training Center of San Diego, where he studied with Erv and Miriam Polster."},{"title":"Scott Temple","icon":null,"tab_color":"#13DC90","card_type":"Profile Card","card_background_color":"#FFFFFF","detail_list":[],"profile_image":"../../uploads/leader2.jpg","profile_subtitle":"Consultant","body_copy":"Scott Temple is a Human Resources Specialist with extensive experience in training and development, change management, meeting facilitation, management consulting, employee relations, benefit administration, customer service, and data analysis in several industries including higher education, early childhood education, automotive, and IT.\n\nScott earned a Master of Science in Human Resource and Organizational Development from Eastern Michigan University, and a Bachelor of Arts from Wayne State University. Scott has first hand experience helping leadership teams and organizations navigate through the difficult conversations and emotions that are involved with major organizational change and evolution."},{"title":"Therese Gleason Carr","icon":null,"tab_color":"#7B1FA2","card_type":"Profile Card","card_background_color":"#FFFFFF","detail_list":[],"profile_image":"../../uploads/leader3.jpg","profile_subtitle":"Consultant","body_copy":"Therese has over 15 years of experience promoting access and equity for culturally and linguistically diverse learners at the local, state and national level. Her background blends expertise in teaching and learning , educational policy and research, program and project management, communications, and outreach. She has taught English as a second language (ESL) and writing to university students and adult learners, and Spanish as a world language in public and private elementary schools. She has also led programs at a state educational agency, in public and private institutions of higher education, and within a large research corporation on contract with the U.S. Department of Education.\n\nTherese has provided educational consulting services to private entities and institutions of higher education including the University of Wisconsin-Madison and the Latino Education Institute at Worcester State University. An accomplished writer and writing teacher, she has presented and published a variety of professional creative work, including a volume of poetry.\n\nTherese earned a Bachelors degree in Spanish and a Masters degree in English with a concentration in Teaching English as a Second Language (TESL) from the University of Kentucky, and completed 36 credit hours of graduate course work in educational psychology, human development, and research from the University of South Carolina."}],"content":null,"right_column_color":null,"parallax_type":null,"image":null,"button":{"button_text":null,"alignment":null,"full_width":false,"button_link":null,"link_internal":false},"logo":null}]}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/team/"}}